testdata/simpleFoam_kO/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          51200;
        startFace       50556;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       101756;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       101796;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1208;
        startFace       101836;
    }
)

// ************************************************************************* //
