testdata/simpleFoam_kO/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ 
 	 version 	 2.0; 
 	 format 	 ascii;
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 	1.0;

vertices 
( 
	 ( 0.0 0.01 0.0 )	// 000
	 ( 1.0 0.01 0.0 )	// 001
	 ( 1.0 0.09 0.0 )	// 002
	 ( 0.0 0.09 0.0 )	// 003
	 ( 0.0 0.01 0.0013 )	// 004
	 ( 1.0 0.01 0.0013 )	// 005
	 ( 1.0 0.09 0.0013 )	// 006
	 ( 0.0 0.09 0.0013 )	// 007
	 ( 1.5 0.01 0.0 )	// 008
	 ( 1.5 0.09 0.0 )	// 009
	 ( 1.5 0.01 0.0013 )	// 010
	 ( 1.5 0.09 0.0013 )	// 011
	 ( 1.0 0.0 0.0 )	// 012
	 ( 1.5 0.0 0.0 )	// 013
	 ( 1.0 0.0 0.0013 )	// 014
	 ( 1.5 0.0 0.0013 )	// 015
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 769  62  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  8  9  2  5  10  11  6)	( 385  62  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 12  13  8  1  14  15  10  5)	( 385  8  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 1  8  9  2)
			( 5  10  11  6)
			( 12  13  8  1)
			( 14  15  10  5)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 8  9  11  10)
			( 13  8  10  15)
		);
	}

	wall
	{
		type wall;
		faces
		(
			( 3  2  6  7)
			( 0  1  5  4)
			( 2  9  11  6)
			( 12  13  15  14)
			( 12  1  5  14)
		);
	}

); 

mergePatchPairs 
( 
); 

