testdata/simpleFoam_kO/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residuals
{
    functionObjectLibs ("libutilityFunctionObjects.so");
    type                residuals;
    writeControl        timeStep;
    writeInterval       1;
    fields
    (
        U
        p
        k
        omega
	epsilon
    );
}
